Тест_ЗУП_31_КОРП/src/Catalogs/ПерепискаСКонтролирующимиОрганами/ПерепискаСКонтролирующимиОрганами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПерепискаСКонтролирующимиОрганами</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПерепискиСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Вспомогательное поле для реализации отбора по организации</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
      <types>CatalogRef.ОрганыФСГС</types>
      <types>CatalogRef.СерверыДокументооборота</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОрганыПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
      <types>CatalogRef.ОрганыФСГС</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОрганыПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ретроконверсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требование</name>
    <type>
      <types>CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ТипыПерепискиСКонтролирующимиОрганами/ТипыПерепискиСКонтролирующимиОрганами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПерепискиСКонтролирующимиОрганами</name>
  <enumValues>
    <name>ПерепискаСФНС</name>
  </enumValues>
  <enumValues>
    <name>ПерепискаСПФР</name>
  </enumValues>
  <enumValues>
    <name>ПерепискаСФСГС</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/СтатусыПисем/СтатусыПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПисем</name>
  <enumValues>
    <name>Полученное</name>
  </enumValues>
  <enumValues>
    <name>Отправленное</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Сохраненное</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ПерепискаСКонтролирующимиОрганами/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ПриЗаписиОбъекта(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДО.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДО.ОбработкаЗаполненияОбъекта(ЭтотОбъект, СообщениеОснование);
	
	ДатаСообщения = ТекущаяДатаСеанса();
	
	Если ТипЗнч(СообщениеОснование) = Тип("Структура")
		И СообщениеОснование.Свойство("Отправитель")
		И ТипЗнч(СообщениеОснование.Отправитель) = Тип("СправочникСсылка.Организации") Тогда
		Организация = СообщениеОснование.Отправитель;
	КонецЕсли;
	
	Если ТипЗнч(СообщениеОснование) = Тип("Структура")
		И СообщениеОснование.Свойство("ОснованиеСсылка")
		И ТипЗнч(СообщениеОснование.ОснованиеСсылка) = Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда
		
		ДокументыРеализацииПолномочийСсылка = СообщениеОснование.ОснованиеСсылка;
		
		Наименование 	= "Ответ на: " + СокрЛП(ДокументыРеализацииПолномочийСсылка.Наименование);
		Тип 			= Перечисления.ТипыПерепискиСКонтролирующимиОрганами.ПерепискаСФНС;
		Статус 			= Перечисления.СтатусыПисем.Исходящее;
		Отправитель 	= ДокументыРеализацииПолномочийСсылка.Организация;
		Получатель 		= ДокументыРеализацииПолномочийСсылка.НалоговыйОрган;
		ДатаСообщения 	= ТекущаяДатаСеанса();
		Требование 		= ДокументыРеализацииПолномочийСсылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторОснования = Неопределено;
	ДатаОтправки = Неопределено;
	ДатаСообщения = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Тип <> Перечисления.ТипыПерепискиСКонтролирующимиОрганами.ПерепискаСФНС Тогда
		Возврат;
	КонецЕсли;
		
	Вложения = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьСписокВложений(ЭтотОбъект.Ссылка);
	
	КоличествоВложений 		= Вложения.Количество();
	МаксимальнойКоличество 	= ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.МаксимальнойКоличествоФайловВПисьме();
	
	Если КоличествоВложений > МаксимальнойКоличество Тогда
		
		ПревышеноНа = КоличествоВложений - МаксимальнойКоличество;
				
		ТекстСообщения = "Допустимое количество приложенных файлов превышено на %1."; 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПревышеноНа);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Отказ = Истина;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
